# TAGS: [user_messages]
# ----- MENU BUTTONS CONSTANTS -----

BTN_MENU = "Главное меню"
BTN_FEEDBACK = "Обратная связь"


INSTRUCTIONS_TO_SHOOT_VIDEO_TEXT = (
    "📹 Запишите кружочек прямо в этом чате или загрузите сюда короткое видео (не более 60 сек):\n" 
    " • Представьтесь\n"
    " • 3-4 фразы об опыте под эту роль и что вы можете принести компании\n"
    " • Смотрите в камеру и улыбайтесь 😊\n"
    " • Не переживайте о техническом качестве, главное - это вы и ваша мотивация.\n"
    " • Менеджеру важнее увидеть живого человека, а не идеально отреперированную речь.\n"
    "----------------------\n"
    "Вы можете делать сколько угодно дублей.\n"
    "Я ничего не отправлю без вашего финального подтверждения.\n"
)

VIDEO_SENDING_CONFIRMATION_TEXT = "Готовы отправить это видео кандидатам или хотите записать другое?"


# ----- DATA SERVICE CONSTANTS -----

APPLICANT_BOT_DATA_DIR = "applicant_bot_data"
APPLICANT_BOT_RECORDS_FILENAME = "applicant_bot_records"


# ----- AI SERVICE CONSTANTS -----

# ----- VIDEO SERVICE CONSTANTS -----

MAX_DURATION_SECS = 90


# ****** CONSTANTS with TAGS: [user_messages] ******

WELCOME_TEXT_WHEN_STARTING_BOT = "Добро пожаловать в бот, где вы сможете посмотреть приветсвенное видео менеджера."

WELCOME_VIDEO_RECORD_REQUEST_TEXT = "Хотите записать видео-визитку для менеджера?\nЭто поможет выделиться на фоне других кандидатов и быстрее выйти на интервью.\nМы подскажем, как это сделать."
WAITING_FOR_ANOTHER_VIDEO_TEXT = "Хорошо, кидайте другое видео в чат.\nЯ попрошу подтверждения перед отправкой."
CONTINUE_WITHIOUT_APPLICANT_VIDEO_TEXT = (
    "Видео-визитка - способ быстро достучаться до менеджера и выйти на интервью.\n"
    "Менеджер сначала просматривает кандидатов с видео и такие уже есть на эту вакансию.\n"
    "Если вы решите записать видео, вы сможете это сделать, нажав кнопку 'Главное меню'.\n"
    "Желаем удачи в поиске!"
)

PRIVACY_POLICY_LINK_APPLICANT = "https://hrvibe.ru/policy-personal-data"
PRIVACY_POLICY_PROCESSING_CONFIRMATION_LINK_APPLICANT = "https://hrvibe.ru/confirmation-personal-data-processing"

PRIVACY_POLICY_CONFIRMATION_TEXT_APPLICANT = (
    f"Для продолжения работы с ботом:\n"
    f"- ознакомьтесь с <a href=\"{PRIVACY_POLICY_LINK_APPLICANT}\">политикой обработки персональных данных</a>\n" 
    f"- подтвердите <a href=\"{PRIVACY_POLICY_PROCESSING_CONFIRMATION_LINK_APPLICANT}\">согласие на обработку персональных данных и видео</a>\n"
)



# ----- USER MESSAGES CONSTANTS with SUCCESS status-----

SUCCESS_TO_GET_PRIVACY_POLICY_CONFIRMATION_TEXT = "Согласие на обработку персональных данных получено, можем продолжить работу."
SUCCESS_TO_GET_WELCOME_VIDEO_TEXT = "Вы уже посмотрели приветственное видео от менеджера."
SUCCESS_TO_SAVE_VIDEO_TEXT = (
    "Ваша видео-визитка успешно сохранена.\n"
    "Менеджер сначала просматривает кандидатов с видео и так что вы уже на голову впереди остальных.\n"
    "Мы покажем ваше резюме и видео менеджеру, и уведомим в этом чате если вас приглясят на интервью.\n"
    "💪 Вы сильный кандидат и у вас все получится! "
)

# ----- USER MESSAGES CONSTANTS with FAIL status-----

FAIL_TECHNICAL_SUPPORT_TEXT = "Произошла ошибка. Тех. поддержка уже спешит на помощь."
FAIL_TO_DOWNLOAD_VIDEO_TEXT = "Ошибка при скачивании видео. Пришмите заново, пожалуйста."
FAIL_TO_IDENTIFY_VIDEO_TEXT = "Не удалось определить видео. Пришлите, пожалуйста, еще раз не текст, не фото или аудио, а именно видео."
FAIL_TO_IDENTIFY_PAYLOAD_TEXT = "Извините. Не удалось определить по какой вакансии и резюме вы пришли."


# ----- USER MESSAGES CONSTANTS with MISSING DATA status-----

MISSING_PRIVACY_POLICY_CONFIRMATION_TEXT = "Чтобы продолжить работу нам необходимо ваше согласие на обработку персональных данных.\nВы можете это сделать, нажав кнопку 'Главное меню'."
MISSING_VIDEO_RECORD_TEXT = "Нет видео для сохранения. Пришлите заново, пожалуйста."

# ----- FEEDBACK CONSTANTS -----

FEEDBACK_REQUEST_TEXT = "Напишите ваш вопрос или обратную связь в чате и я направлю ее админу."
FEEDBACK_SENT_TEXT = "Ваше сообщение отправлено администратору. Спасибо за обратную связь!"
FEEDBACK_ONLY_TEXT_ALLOWED_TEXT = "Пожалуйста, отправьте только текстовое сообщение. Видео, аудио и изображения пока не принимаются."


INFO_UPLOADING_WELCOME_VIDEO_TEXT = "Уже загрузаю видео от менеджера..."
INFO_VIDEO_ALREADY_SAVED_TEXT = "Вы уже направили видео-визитку."
INFO_DOWNLOADING_APPLICANT_VIDEO_STARTED_TEXT = "Сохраняю ваше видео..."
INFO_ABOUT_VIDEO_DELETION_TEXT = "Если в какой-то момент вы захотите удалить вашу видео визитку. Напишите об этом в тех поддержку, нажав кнопку 'Обратная связь'."