# TAGS: [user_messages]

PROMPT_DIR = "docs/ai_prompts"
RESUME_PASSED_SCORE = 6
VACANCY_STATUS_TO_FILTER = "open"


TARGET_EMPLOYER_STATE_COLLECTION_STATUS = "response"
NEW_EMPLOYER_STATE_COLLECTION_STATUS = "consider"


# ----- MENU BUTTONS CONSTANTS -----

BTN_MENU = "Главное меню"
BTN_FEEDBACK = "Обратная связь"

BASE_URL = "https://hrvibe-hh-callback-endpoint.onrender.com"


# ----- VIDEO DIRECTORIES CONSTANTS -----


BOT_FOR_APPLICANTS_USERNAME="MeetYourManagerBot"

CALLBACK_ENDPOINT_RESPONSE_WHEN_RECORDS_NOT_READY = {'detail': 'State not ready or not found'}


INSTRUCTIONS_TO_SHOOT_VIDEO_TEXT = (
    "📹 Запишите прямо в телеграме или загрузите КОРОТКОЕ приветственное видео (не более 60 секунд).\n" 
    " - Расскажите несколько слов о компании, вакансии\n"
    " - Если есть какие-то осособые требования, упомяните о них.\n"
    " - Не забудьте улыбнуться =)\n"
    "Вы можете делать сколько угодно дублей. Я ничего не отправлю без вашего финального подтверждения."
)
VIDEO_SENDING_CONFIRMATION_TEXT = (
    "Готовы отправить это видео кандидатам или хотите записать другое?"
)

# ----- DATA SERVICE CONSTANTS -----

DATA_DIR = "users_data"
USERS_RECORDS_FILENAME = "records"
RESUME_RECORDS_FILENAME = "resume_records"
RESUME_SUBDIRECTORIES_LIST = ["new", "passed", "failed"]

# ----- AI SERVICE CONSTANTS -----

MODEL_NAME = "gpt-5"

# ----- VIDEO SERVICE CONSTANTS -----

VIDEO_SAVED_TEXT = "🚀Поздравляю, я записал вае видео и покажу его кандидатам, которые прошли скриннинг."
MAX_DURATION_SECS = 90


# ****** CONSTANTS with TAGS: [user_messages] ******

WELCOME_TEXT_WHEN_STARTING_BOT = "Добро пожаловать в ИИ-ассистент для работы с вакансиями на сайте HeadHunter."
AUTH_REQ_TEXT = "👋 Авторизуйтесь на сайте HeadHunter чтобы у меня был доступ к вашим открытым вакансиям. "
AUTH_SUCCESS_TEXT = "✅ Авторизация завершена. Теперь я могу просматривать ваши открытые вакансии."
AUTH_FAILED_TEXT = "❌ Не получилось авторизоваться.\nПожалуйста, пройдите авторизацию по ссылке выше или нажмите кнопку 'Статус'."

WELCOME_VIDEO_RECORD_REQUEST_TEXT = "Хотите записать короткое приветственное видео?\nОно значительно повышат количество видео визиток от кандидатов.\nМы подскажем, как это сделать."
WAITING_FOR_ANOTHER_VIDEO_TEXT = "Хорошо, кидайте другое видео в чат.\nЯ попрошу подтверждения перед отправкой кандидатам."
CONTINUE_WITHIOUT_WELCOME_VIDEO_TEXT = "Продолжим без приветственного видео. Вы можете вернуться к этому этапу командой нажав кнопку 'Главное меню'."


PRIVACY_POLICY_LINK = "https://hrvibe.ru/policy-personal-data"
PRIVACY_POLICY_PROCESSING_CONFIRMATION_LINK = "https://hrvibe.ru/confirmation-personal-data-processing"

PRIVACY_POLICY_CONFIRMATION_TEXT = (
    f"Для продолжения работы с ботом:\n"
    f"- ознакомьтесь с <a href=\"{PRIVACY_POLICY_LINK}\">политикой обработки персональных данных</a>\n" 
    f"- подтвердите <a href=\"{PRIVACY_POLICY_PROCESSING_CONFIRMATION_LINK}\">согласие на обработку персональных данных и видео</a>\n"
)

APPLICANT_MESSAGE_TEXT_WITHOUT_LINK = "Здравствуйте. Мы очень заинтересовались вашим резюме. Чтобы ускорить процесс выхода на интервью, пройдите в телеграм бота и посмотрите приветственное видео менеджера:"


# ----- USER MESSAGES CONSTANTS with SUCCESS status-----

SUCCESS_TO_GET_PRIVACY_POLICY_CONFIRMATION_TEXT = "Согласие на обработку персональных данных получено, можем продолжить работу."
SUCCESS_TO_HH_AUTHORIZATION_TEXT = "Вы успешно авторизовались в HeadHunter.ru."
SUCCESS_TO_SELECT_VACANCY_TEXT = "Вы уже выбрали вакансию для работы."
SUCCESS_TO_RECORD_VIDEO_TEXT = "Вы уже записали преветственное видео."
SUCCESS_TO_SAVE_VIDEO_TEXT = "Приветственное видео успешно сохранено."
SUCCESS_TO_GET_SOURCING_CRITERIAS_TEXT = "Я уже проанализировал вакансию и определил критерии для отбора кандидатов."

# ----- USER MESSAGES CONSTANTS with FAIL status-----

FAIL_TECHNICAL_SUPPORT_TEXT = "Произошла ошибка. Тех. поддержка уже спешит на помощь."
FAILED_TO_GET_OPEN_VACANCIES_TEXT = "Не удалось получить открытые вакансии.\nВозможно, у вас нет открытых вакансий или произошла ошибка.\nРазместите вакансию на сайте HeadHunter и попробуйте еще раз, нажав кнопку 'Главное меню'."


# ----- USER MESSAGES CONSTANTS with MISSING DATA status-----

MISSING_PRIVACY_POLICY_CONFIRMATION_TEXT = "Чтобы продолжить работу нам необходимо ваше согласие на обработку персональных данных.\nВы можете это сделать, нажав кнопку 'Главное меню'."
MISSING_VACANCY_SELECTION_TEXT = "Вы не выбрали вакансию для работы.\nВы можете сделать это, нажав кнопку 'Главное меню'."
MISSING_VACANCY_DESCRIPTION_TEXT = "у меня нет описания вакансии.\nПожалуйста, запросите описание вакансии, нажав кнопку 'Главное меню'."
MISSING_SOURCING_CRITERIAS_TEXT = "У меня нет критериев отбора кандидатов.\nПожалуйста, получите критерии отбора кандидатов, нажав кнопку 'Главное меню'."
MISSING_VIDEO_RECORD_TEXT = "Нет видео для сохранения. Пришлите заново, пожалуйста."

# ----- FEEDBACK CONSTANTS -----

FEEDBACK_REQUEST_TEXT = "Напишите ваш вопрос или обратную связь в чате и я направлю ее админу."
FEEDBACK_SENT_TEXT = "Ваше сообщение отправлено администратору. Спасибо за обратную связь!"
FEEDBACK_ONLY_TEXT_ALLOWED_TEXT = "Пожалуйста, отправьте только текстовое сообщение. Видео, аудио и изображения пока не принимаются."

# ----- INTERVIEW INVITATION CONSTANTS -----

BTN_INVITE_TO_INTERVIEW = "Пригласить на интервью"
INVITE_TO_INTERVIEW_CALLBACK_PREFIX = "invite_to_interview"
INVITE_TO_INTERVIEW_SENT_TEXT = "Пошел приглашать кандидата на интервью, с вами свяжутся в ближайшее время."